{"name": "Abbedagge", "id": 0, "description": "Abbedagge plays mid laner for 100 Thieves. His ID comes from a unit’s sound in Age of Empires. He was awarded NA 2nd All Pro Team in Summer 2021." },
{ "name": "Ablazeolive", "id": 1, "description": "Ablazeolive plays mid laner for Golden Guardians. He is known for his play on control mages and breakout performance in the 2021 LCS on champs like Zoe and Lucian." },
{ "name": "aphromoo", "id": 2, "description": "Aphromoo plays support for FlyQuest. He is well-known for his early days of playing as an ADC with v8 eSports and his popular streams. He is the oldest player in the LCS as of Spring 2022." },
{ "name": "Berserker", "id": 3, "description": "Berserker plays bot laner for Cloud9. He originally played in South Korea's primary and secondary leagues."},
{ "name": "Biofrost", "id": 4, "description": "Biofrost plays support for Dignitas. His father also plays league. He is commonly referred to as Biodaddy, a name originally given to him by his teammate Doublelift." },
{ "name": "Bjergsen", "id": 5, "description": "Bjergsen plays mid laner for Team Liquid. He reached 1000 Kills in the NA LCS on July 23, 2017 and is one of two players to record a pentakill in both the NA and EU LCS." },
{ "name": "Blaber", "id": 6, "description": "Blaber plays jungler for Cloud9. He was previously known as blaberfish2 and has the record for highest win percentage of any LCS player with more than 1 game played." },
{ "name": "Blue", "id": 7, "description": "Blue plays mid laner for Dignitas. He has reached rank 1 on Europe West. Previously known as Araxe and Roy." },
{ "name": "Bwipo", "id": 8, "description": "Bwipo plays top laner for Team Liquid. He has often appeared on LEC broadcasts as a guest commentator and many fans tout him as a future LEC caster." },
{ "name": "Closer", "id": 9, "description": "Closer plays jungler for 100 Thieves. His ID is a reference to the TV show Suits. He was previously known as K1ra." },
{ "name": "Contractz", "id": 10, "description": "Contractz plays jungler for Counter Logic Gaming. He started playing League of Legends in early season 2 and has been playing competitively since he was 14." },
{ "name": "CoreJJ", "id": 11, "description": "CoreJJ plays support for Team Liquid. His ID comes from a character's dialogue in Avalon Online. He is a two-time LCS champion and one-time world champion." },
{ "name": "Danny", "id": 12, "description": "Danny plays bot laner for Evil Geniuses. He has recorded 5 pentakills, all against different teams. He started playing League of Legends when he was 6 years old, first reached Challenger when he was 14, and debuted in LCS when he was 17." },
{ "name": "IgNar", "id": 13, "description": "IgNar plays support for Immortals. He became world famous after he beat SK Telecom T1 in the 2017 World Championship Quarterfinals on Blitzcrank and Leona with Fervor of Battle. He has won several awards across EU and NA."},
{ "name": "Gamsu", "id": 14, "description": "Gamsu plays top laner for Dignitas. He recorded a pentakill in July 2021. He had a short stint playing professional Overwatch before focusing full-time of League of Legends in late 2020." },
{ "name": "FBI", "id": 15, "description": "FBI plays bot laner for 100 Thieves. First Australian to play in the LCS. His ID makes reference to an Australian internet cafe that he spent a lot of time playing in." },
{ "name": "Jensen", "id": 16, "description": "Jensen plays mid laner for Cloud9. He was previously known as Incarnati0n, and was permanently banned from competitive play until April 2015." },
{ "name": "Hans sama", "id": 17, "description": "Hans sama plays bot laner for Team Liquid. He has played League of Legends since Season 1. He reached 1000 kills in the LEC in August 2021." },
{ "name": "huhi", "id": 18, "description": "huhi plays support for 100 Thieves. In his prime as a mid laner, known for a heavy roaming playstyle, in contrast to more lane-focused players. He was the first player to win an LCS title at two different positions." },
{ "name": "Shenyi", "id": 19, "description": "Shenyi plays support for TSM. He shines brightest as a shot caller. His ID means 'God Doctor' in Chinese." },
{ "name": "Impact", "id": 20, "description": "Impact plays top laner for Evil Geniuses. He was previously known as Coke. He has won numerous awards across LCS. He is considered an excellent tank player and teamfighter." },
{ "name": "Inspired", "id": 21, "description": "Inspired plays jungler for Evil Geniuses. He is the first Polish player to compete in the LCS. He is known for achieving Top 50 in Challenger at 15 years old and for becoming the first LEC jungler to get a pentakill in an official LEC match." },
{ "name": "Zven", "id": 22, "description": "Zven plays support for Cloud9. He was previously known as Niels, and is the first player to ever win a championship in both LEC and LCS." },
{ "name": "Jenkins", "id": 23, "description": "Jenkins plays top laner for Counter Logic Gaming. He is known for his Kennen." },
{ "name": "Johnsun", "id": 24, "description": "Johnsun plays bot laner for FlyQuest. In May 2021, he rejoined the team from the academy roster." },
{ "name": "jojopyun", "id": 25, "description": "jojopyun plays mid laner for Evil Geniuses. He is the youngest player to win the LCS, and known for his trash talk. He was a professional Fortnite player before switching to League of Legends." },
{ "name": "Josedeodo", "id": 26, "description": "Josedeodo plays jungler for FlyQuest. He has reached Rank 1 on NA, BR and LAS. Commonly referred to as the greatest jungler in LatAm." },
{ "name": "Kumo", "id": 27, "description": "Kumo plays top laner for FlyQuest. In just his second LCS game, he made highlight reels after outplaying and solo killing Impact's Aatrox as Jayce. He was previously known as League and Shiro." },
{ "name": "Licorice", "id": 28, "description": "Licorice plays top laner for Golden Guardians. Licorice was the runner up to the prize of 'Esports PC Rookie of the Year' at the Esports Awards in 2018. He has played competitively for GG, FLY and C9 in the last 3 years." },
{ "name": "Lost", "id": 29, "description": "Lost plays bot laner for Golden Guardians. He is the first New Zealand player to compete outside of the OPL. He recorded a pentakill in March 2021 against Cloud9." },
{ "name": "Luger", "id": 30, "description": "Luger plays bot laner for Counter Logic Gaming. He recorded a pentakill in LCS trial ground in September 2021, and joined CLG in November." },
{ "name": "Neo", "id": 31, "description": "Neo plays bot laner for Dignitas. He recorded a pentakill in March 2021 against Golden Guardians. Previously known as Asta." },
{ "name": "Olleh", "id": 32, "description": "Olleh plays support for Golden Guardians. He reached Rank 1 in Solo Ranked in the Brazilian, Taiwanese and NA servers. Best known for his Morgana throughout his career, and his Tahm Kench after joining Team Liquid." },
{ "name": "Palafox", "id": 33, "description": "Palafox plays mid laner for Counter Logic Gaming. He reached Rank 1 on the North American server in 2020 and recorded a pentakill that same year with C9 Academy." },
{ "name": "Poome", "id": 34, "description": "Poome plays support for Counter Logic Gaming. Known for his Thresh and Bard. He previously played for 100Thieves." },
{ "name": "PowerOfEvil", "id": 35, "description": "PowerOfEvil plays mid laner for Immortals. Famous for his Orianna and his unique build on her (Nashor's Tooth). His ID comes from Warcraft III." },
{ "name": "Pridestalker", "id": 36, "description": "Pridestalker plays jungler for Golden Guardians. He recorded two pentakills in the last few months of 2021. He is also known as Pride and Pridestalkr." },
{ "name": "Revenge", "id": 37, "description": "Revenge plays top laner for Immortals. He reached rank 1 with multiple accounts before age 17. He planned to go to medical school before starting his competitive career." },
{ "name": "River", "id": 38, "description": "River plays jungler for Dignitas. He recorded a pentakill in July 2021. Previously known as Baby." },
{ "name": "Santorin", "id": 39, "description": "Santorin plays jungler for Team Liquid. His main champion is Lee Sin. He is criticized occasionally for being an excessively passive jungler, with some referring to him derogatorily as a 'living ward'." },
{ "name": "Huni", "id": 40, "description": "Huni plays top laner for TSM. He is known for his deep champion pool and aggressive, lane-dominant playstyle." },
{ "name": "Tactical", "id": 41, "description": "Tactical plays bot laner for TSM. He has reached Rank 1 on NA, and earned his spot on TSM's main roster after an impressive performce standing in for teammate Doublelift." },
{ "name": "Ssumday", "id": 42, "description": "Ssumday plays top laner for 100 Thieves. Known for playing tanks and bruisers such as Renekton and Shen. He was previously known as Sunday." },
{ "name": "Fudge", "id": 43, "description": "Fudge plays top laner for Cloud9. He joined Cloud9 in November 2019 as part of the LCS academy roster." },
{ "name": "Spica", "id": 44, "description": "Spica plays jungler for TSM. Known for performing a '9 man sleep' at Worlds 2020 after ulting all five enemy champions as Lillia but receiving no follow-up from his team." },
{ "name": "Maple", "id": 45, "description": "Maple plays mid laner for TSM. He started his career in the LMS and has made LMS All-Pro 1st Team 4 separate times." },
{ "name": "toucouille", "id": 46, "description": "toucouille plays mid laner for FlyQuest. In 2021, his spring regular-season performances earned him the LFL Spring Split MVP title." },
{ "name": "Vulcan", "id": 47, "description": "Vulcan plays support for Evil Geniuses. He is the first Québécois to both compete in and win an LCS Title." },
{ "name": "Arrow", "id": 48, "description": "Arrow plays bot laner for Immortals. Known for his incredible mechanics, he is one of the few Korean AD carries to have played Draven in competitive play and also have Draven banned against him." },
{ "name": "Kenvi", "id": 49, "description": "Kenvi plays jungler for Immortals. He earned the nickname 'The Terminator' for his high kill count and aggressive playstyle while playing in the North American Amateur scene. He was formerly known as Kenv1." }